import React from 'react';
import { Grid, Button, ListItemText } from '@mui/material';

const addressOptions = [
    { key: 'بلدية البيرة', value: 'بلدية البيرة', lng: '35.21227528123269', lat: '31.90651343631193' },
    { key: 'إسعاد الطفولة', value: 'البيرة إسعاد الطفولة', lng: '35.22326739328995', lat: '31.908424907854172' },
    { key: 'المدرسة الهاشمية', value: 'البيرة المدرسة الهاشمية', lng: '35.21241599442541', lat: '31.898712703232725' },
    { key: 'ام الشرايط', value: 'ام الشرايط', lng: '35.210063537123716', lat: '31.885349719454986' },
    { key: 'شارع نابلس', value: 'شارع نابلس', lng: '35.21585479442631', lat: '31.916855130904487' },
    { key: 'شارع القدس', value: 'شارع القدس', lng: '35.21943579442432', lat: '31.879480394922457' },
    { key: 'حي الجنان', value: 'البيرة حي الجنان', lng: '35.2158125522773', lat: '31.901179041085417' },
    { key: 'البالوع', value: 'البالوع', lng: '35.21265322989192', lat: '31.923608283267978' },
    { key: 'المنطقة الصناعية', value: 'البيرة المنطقة الصناعية', lng: '35.21768900792097', lat: '31.91444498693257' },
    { key: 'وسط البلد', value: 'وسط البلد', lng: '35.20438048277668', lat: '31.90491700216446' },
    { key: 'رام الله التحتا', value: 'رام الله التحتا', lng: '35.19704692588746', lat: '31.904216542946664' },
    { key: 'الماصيون', value: 'الماصيون', lng: '35.199577748210366', lat: '31.890455004515925' },
    { key: 'عين منجد', value: 'عين منجد', lng: '35.19387293827972', lat: '31.896775885359375' },
    { key: 'بطن الهوا', value: 'بطن الهوا', lng: '35.19272757908504', lat: '31.901754465452566' },
    { key: 'عين مصباح', value: 'عين مصباح', lng: '35.20136260792058', lat: '31.90881518823174' },
    { key: 'المصايف', value: 'المصايف', lng: '35.2027221074367', lat: '31.919865069969173' },
    { key: 'الارسال', value: 'الارسال', lng: '35.206593421415725', lat: '31.91588994314179' },
    { key: 'سميراميس', value: 'سميراميس', lng: '35.212702407919366', lat: '31.883147124796217' },
    { key: 'سطح مرحبا', value: 'سطح مرحبا', lng: '35.2132378944254', lat: '31.89813099138013' },
    { key: 'دوار رافات', value: 'دوار رافات', lng: '35.199442778108576', lat: '31.8820102365128' },
    { key: 'شارع بيت ايل', value: 'شارع بيت ايل', lng: '35.2202159743176', lat: '31.93195063661914' },
    { key: 'الطيرة', value: 'الطيرة', lng: '35.18172548679388', lat: '31.91086169820859' },
    { key: 'مفرق الحتو', value: 'بيتونيا مفرق الحتو', lng: '35.17538666005299', lat: '31.89417049748842' },
    { key: 'البالوع', value: 'بيتونيا البالوع', lng: '35.164177668917205', lat: '31.898020824650946' },
    { key: 'رافات', value: 'رافات', lng: '35.19231016393194', lat: '31.871273204919166' },
    { key: 'ضاحية الزراعة', value: 'ضاحية الزراعة', lng: '35.213176181898305', lat: '31.94505425391745' },
    { key: 'أبوقش', value: 'أبوقش', lng: '35.184461164207455', lat: '31.951531938312378' },
    { key: 'الريحان', value: 'الريحان', lng: '35.16849641208859', lat: '31.93698102696387' },
    { key: 'ضاحية الغدير', value: 'ضاحية الغدير', lng: '35.19292825025275', lat: '31.95248979044017' },
    { key: 'عين قينيا', value: 'عين قينيا', lng: '35.14955399481005', lat: '31.92847965246811' },
    { key: 'بيرزيت', value: 'بيرزيت', lng: '35.19621331769557', lat: '31.975967158059166' },
    { key: 'بيرنبالا', value: 'بيرنبالا', lng: '35.20057716386705', lat: '31.852346386376194' },
    { key: 'قلنديا البلد', value: 'قلنديا البلد', lng: '35.20774199458338', lat: '31.86217802418762' },
    { key: 'الجلزون', value: 'الجلزون', lng: '35.21251665625281', lat: '31.951537010826346' },
    { key: 'الجديرة', value: 'الجديرة', lng: '35.19751399456635', lat: '31.856602840504983' },
    { key: 'مخيم قلنديا', value: 'مخيم قلنديا', lng: '35.22878534349546', lat: '31.8646824058048' },
    { key: 'الجيب', value: 'الجيب', lng: '35.183016825227966', lat: '31.851059797232892' },
    { key: 'كوبر', value: 'كوبر', lng: '35.158437305451876', lat: '31.985938808379487' },
    { key: 'أبو شخيدم', value: 'أبو شخيدم', lng: '35.17046293264817', lat: '31.966654777653837' },
    { key: 'المزرعة الغربية', value: 'المزرعة الغربية', lng: '35.16166662510915', lat: '31.95503060131853' },
    { key: 'برهام', value: 'برهام', lng: '35.17561604146166', lat: '31.988184128280793' },
    { key: 'جيبيا', value: 'جيبيا', lng: '35.16085316436647', lat: '31.997137836500684' },
    { key: 'جفنا', value: 'جفنا', lng: '35.214405010847116', lat: '31.963970558834166' },
    { key: 'عين سينيا', value: 'عين سينيا', lng: '35.227622333600316', lat: '31.972164026597078' },
    { key: 'عطارة', value: 'عطارة', lng: '35.209096840106675', lat: '32.00089353650394' },
    { key: 'دورا القرع', value: 'دورا القرع', lng: '35.22683679376513', lat: '31.958735301723912' },
    { key: 'بيتين', value: 'بيتين', lng: '35.23751147093229', lat: '31.92728015041365' },
    { key: 'الرام', value: 'الرام', lng: '35.23391780930673', lat: '31.850635081724732' },
    { key: 'روابي', value: 'روابي', lng: '35.19017679283786', lat: '32.01163493394639' },
    { key: 'ام صفا', value: 'ام صفا', lng: '35.16552399508746', lat: '32.00901239907448' },
    { key: 'عين يبرود', value: 'عين يبرود', lng: '35.25002331762001', lat: '31.95471333885183' },
    { key: 'دير دبوان', value: 'دير دبوان', lng: '35.268987656114525', lat: '31.911712850204044' },
    { key: 'دير السودان', value: 'دير السودان', lng: '35.1486313338049', lat: '32.03246293951637' },
    { key: 'ترمسعيا', value: 'ترمسعيا', lng: '35.28794550312702', lat: '32.033669743905676' },
    { key: 'سنجل', value: 'سنجل', lng: '35.26384882585318', lat: '32.034114217080976' },
    { key: 'أبو فلاح', value: 'أبو فلاح', lng: '35.302869148507746', lat: '32.015084379063204' },
    { key: 'النبي صالح', value: 'النبي صالح', lng: '35.124178936772644', lat: '32.016488231720935' },
    { key: 'عارورة', value: 'عارورة', lng: '35.17557466104853', lat: '32.04392538688307' },
    { key: 'يبرود', value: 'يبرود', lng: '35.2431276106514', lat: '31.976866960289478' },
    { key: 'المغير', value: 'المغير', lng: '35.34238670247298', lat: '32.01929998804002' },
    { key: 'بيت ريما', value: 'بيت ريما', lng: '35.10346431789116', lat: '32.033713319667854' },
    { key: 'دير غسانة', value: 'دير غسانة', lng: '35.097265349769955', lat: '32.04775410725755' },
    { key: 'عابود', value: 'عابود', lng: '35.068463333752234', lat: '32.01675516195101' },
    { key: 'قراوة بني زيد', value: 'قراوة بني زيد', lng: '35.1252589952374', lat: '32.05290056828238' },
    { key: 'عبوين', value: 'عبوين', lng: '35.201014656524315', lat: '32.03181152722088' },
    { key: 'سلواد', value: 'سلواد', lng: '35.26160716430563', lat: '31.980188687502746' },
    { key: 'دير ابو مشعل', value: 'دير ابو مشعل', lng: '35.07058591951374', lat: '32.00205619167071' },
    { key: 'المزرعة الشرقية', value: 'المزرعة الشرقية', lng: '35.27595999506818', lat: '32.0040364786306' },
    { key: 'دير جرير', value: 'دير جرير', lng: '35.2942048097047', lat: '31.967211821844604' },
    { key: 'كفر مالك', value: 'كفر مالك', lng: '35.31039231774662', lat: '31.99129177513566' },
    { key: 'الطيبة', value: 'الطيبة', lng: '35.297881841509586', lat: '31.95934979958164' },
    { key: 'رمون', value: 'رمون', lng: '35.299810978892786', lat: '31.92760622279111' },
    { key: 'تل النصبة', value: 'تل النصبة', lng: '35.21636999442475', lat: '31.885811083940286' },
    { key: 'الارسال بعد البيست ايسترن', value: 'الارسال بعد البيست ايسترن', lng: '35.208959737392796', lat: '31.926691243773913' }
]


const AddressNav = ({ onAddressSelect }) => {
    const chunkArray = (arr, chunkSize) => {
        const chunks = [];
        for (let i = 0; i < arr.length; i += chunkSize) {
            chunks.push(arr.slice(i, i + chunkSize));
        }

        return chunks;
    };

    const optionChunks = chunkArray(addressOptions, 8);

    return (
        <Grid container spacing={2}>
            {optionChunks.map((chunk, chunkIndex) => (
                <Grid item xs={16} key={`chunk-${chunkIndex}`}>
                    <Grid container spacing={2}>
                        {chunk.map((option) => (
                            <Grid item xs={1.5} key={option.key}>
                                <Button
                                    sx={{ color: 'black', padding: '2px', backgroundColor: 'white', width: '5vw', height: '100%', mt: '1px', border: 'solid 1px black' }}
                                    onClick={() => onAddressSelect(option)}
                                >
                                    <ListItemText primary={option.value} />
                                </Button>
                            </Grid>
                        ))}
                    </Grid>
                </Grid>
            ))}
        </Grid>
    );
};

export default AddressNav;
